## Adding config_sensitive_version 

For context when we made `config_sensitive` a `write_only` field, it was no longer in state - therefore it wasn't subject to change detection. 

Based on [Best Practices](https://developer.hashicorp.com/terraform/plugin/sdkv2/resources/write-only-arguments#best-practices) outlined on the Terraform docs, it seems that inclusion of an `int` field should be used to indicate a change in a `write_only` field.

Therefore adding `config_sensitive_version` and marking this as required when `config_sensitive` is set.

### Setting `config_sensitive` without `config_sensitive_value`

```hcl
data "pipes_organization" "rr" {
  handle = "roadrunner"
}

resource "pipes_organization_connection" "gcp" {
  organization = data.pipes_organization.rr.handle
  handle = "gcp_connection"
  plugin = "gcp"

  config = jsonencode({
    project     = "does-this-need-to-work"
    ignore_error_codes = ["401", "403", "500"]
  })

  config_sensitive = jsonencode({
    credentials = var.gcp_creds
  })
}

variable "gcp_creds" {
  type = string
  sensitive = true
  default = "blah"
}
```

`tf apply`

```
│ Error: Missing required argument
│ 
│   with pipes_organization_connection.gcp,
│   on terraform.tf line 20, in resource "pipes_organization_connection" "gcp":
│   20:   config_sensitive = jsonencode({
│   21:     credentials = var.gcp_creds
│   22:   })
│ 
│ "config_sensitive": all of `config_sensitive,config_sensitive_version` must be specified
```

### Setting `config_sensitive_version` as a string

```hcl
// ...
  config_sensitive_version = "x"
// ...
```

`tf apply`
```
│ Error: Incorrect attribute value type
│ 
│   on terraform.tf line 24, in resource "pipes_organization_connection" "gcp":
│   24:   config_sensitive_version = "x"
│ 
│ Inappropriate value for attribute "config_sensitive_version": a number is required.
```

### Happy Path New Resource
```hcl
data "pipes_organization" "rr" {
  handle = "roadrunner"
}

resource "pipes_organization_connection" "gcp" {
  organization = data.pipes_organization.rr.handle
  handle = "gcp_connection"
  plugin = "gcp"

  config = jsonencode({
    project     = "does-this-need-to-work"
    ignore_error_codes = ["401", "403", "500"]
  })

  config_sensitive = jsonencode({
    credentials = var.gcp_creds
  })

  config_sensitive_version = 1
}

variable "gcp_creds" {
  type = string
  sensitive = true
  default = "blah"
}
```

`tf apply`

```
data.pipes_organization.rr: Reading...
data.pipes_organization.rr: Read complete after 0s [id=o_d2k36ditjv1j579u5j0g]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # pipes_organization_connection.gcp will be created
  + resource "pipes_organization_connection" "gcp" {
      + config                              = jsonencode(
            {
              + ignore_error_codes = [
                  + "401",
                  + "403",
                  + "500",
                ]
              + project            = "does-this-need-to-work"
            }
        )
      + config_sensitive                    = (write-only attribute)
      + config_sensitive_version            = 1
      + config_source                       = (known after apply)
      + connection_id                       = (known after apply)
      + created_at                          = (known after apply)
      + created_by                          = (known after apply)
      + credential_source                   = (known after apply)
      + handle                              = "gcp_connection"
      + handle_dynamic                      = (known after apply)
      + handle_mode                         = (known after apply)
      + id                                  = (known after apply)
      + integration_resource_identifier     = (known after apply)
      + integration_resource_name           = (known after apply)
      + integration_resource_path           = (known after apply)
      + integration_resource_type           = (known after apply)
      + last_error_at                       = (known after apply)
      + last_error_process_id               = (known after apply)
      + last_successful_update_at           = (known after apply)
      + last_successful_update_process_id   = (known after apply)
      + last_update_attempted_at            = (known after apply)
      + last_update_attempted_at_process_id = (known after apply)
      + managed_by_id                       = (known after apply)
      + organization                        = "roadrunner"
      + organization_id                     = (known after apply)
      + parent_id                           = (known after apply)
      + plugin                              = "gcp"
      + plugin_version                      = (known after apply)
      + status                              = (known after apply)
      + tenant_id                           = (known after apply)
      + trunk                               = (known after apply)
      + type                                = (known after apply)
      + updated_at                          = (known after apply)
      + updated_by                          = (known after apply)
      + version_id                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

pipes_organization_connection.gcp: Creating...
pipes_organization_connection.gcp: Creation complete after 0s [id=roadrunner/gcp_connection]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

`tf plan`
```
data.pipes_organization.rr: Reading...
data.pipes_organization.rr: Read complete after 0s [id=o_d2k36ditjv1j579u5j0g]
pipes_organization_connection.gcp: Refreshing state... [id=roadrunner/gcp_connection]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```

Changing `config_sensitive` without `config_sensitive_version` being updated
```hcl
data "pipes_organization" "rr" {
  handle = "roadrunner"
}

resource "pipes_organization_connection" "gcp" {
  organization = data.pipes_organization.rr.handle
  handle = "gcp_connection"
  plugin = "gcp"

  config = jsonencode({
    project     = "does-this-need-to-work"
    ignore_error_codes = ["401", "403", "500"]
  })

  config_sensitive = jsonencode({
    credentials = var.gcp_creds
  })

  config_sensitive_version = 1
}

variable "gcp_creds" {
  type = string
  sensitive = true
  default = "blah2"
}
```

```
data.pipes_organization.rr: Reading...
data.pipes_organization.rr: Read complete after 0s [id=o_d2k36ditjv1j579u5j0g]
pipes_organization_connection.gcp: Refreshing state... [id=roadrunner/gcp_connection]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```

Updating `config_sensitive_version`
```hcl
data "pipes_organization" "rr" {
  handle = "roadrunner"
}

resource "pipes_organization_connection" "gcp" {
  organization = data.pipes_organization.rr.handle
  handle = "gcp_connection"
  plugin = "gcp"

  config = jsonencode({
    project     = "does-this-need-to-work"
    ignore_error_codes = ["401", "403", "500"]
  })

  config_sensitive = jsonencode({
    credentials = var.gcp_creds
  })

  config_sensitive_version = 2
}

variable "gcp_creds" {
  type = string
  sensitive = true
  default = "blah2"
}
```

`tf apply` **Note: The delay was due to me verifying we get the updated write_only value and taking a screen cap from debugger, it's not this slow**

```
data.pipes_organization.rr: Reading...
data.pipes_organization.rr: Read complete after 0s [id=o_d2k36ditjv1j579u5j0g]
pipes_organization_connection.gcp: Refreshing state... [id=roadrunner/gcp_connection]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # pipes_organization_connection.gcp will be updated in-place
  ~ resource "pipes_organization_connection" "gcp" {
      ~ config_sensitive_version        = 1 -> 2
        id                              = "roadrunner/gcp_connection"
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

pipes_organization_connection.gcp: Modifying... [id=roadrunner/gcp_connection]
pipes_organization_connection.gcp: Still modifying... [id=roadrunner/gcp_connection, 00m10s elapsed]
pipes_organization_connection.gcp: Modifications complete after 12s [id=roadrunner/gcp_connection]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```

<img width="269" height="65" alt="image" src="https://github.com/user-attachments/assets/48f7688f-bcc3-413b-9f26-2ff5ae8f35e2" />

`tf plan`
```
data.pipes_organization.rr: Reading...
data.pipes_organization.rr: Read complete after 0s [id=o_d2k36ditjv1j579u5j0g]
pipes_organization_connection.gcp: Refreshing state... [id=roadrunner/gcp_connection]

No changes. Your infrastructure matches the configuration.
```